//Найдите те или иные реальные объекты и найдите их свойства. Например у маркера это цвет, толщина, уровень зарядки (количество краски), у автомобиля - бренд, модель, мощность двигателя, цвет и так далее. Создайте объекты с помощью {}. В качестве образца посмотрите объект персоны из материала предыдущего занятия
//----------------

let man = {
    age: 30,
    height: "189 cm",
    weight: "90 kg",
    hair: "blonde",
    married: true
}

let animal = {
    type: "cat",
    color: "white",
    name: "Tom",
    male: true
}