// Сформируйте строку с шахматной доской из вложенных циклов. Для перевода строки используйте \n. Код должен поддерживать легкое изменение размеров доски.
//------------------
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
// .#.#.#.#.#.#
// #.#.#.#.#.#.
//------------------

let str = ""
for (j = 0; j < 10; j++) {
    if (j % 2 == 0) {
        for (i = 0; i < 10; i++) {
            if (i % 2 == 0) {
                str += "."
            } else {
                str += "#"
            }
        }
    } else {
         for (i = 0; i < 10; i++) {
            if (i % 2 == 0) {
                str += "#"
            } else {
                str += "."
            }
        }   
    }
    str += "\n"
}
console.log(str)


