//Сформировать следующую строку - треугольник:
// .....#.....
// ....###....
// ...#####...
// ..#######..
// .#########.
// ###########
//------------------

let str = ""
for (j = 0; j < 6; j++) {
    for (i = 0; i <= 10; i++) {
        if (j == 0 && i == 5) {
            str += '#'
        } else if (j == 1 && i > 3 && i < 7) {
            str += "#"
        } else if (j == 2 && i > 2 && i < 8) {
            str += "#"
        } else if (j == 3 && i > 1 && i < 9) {
            str += "#"
        } else if (j == 4 && i > 0 && i < 10) {
            str += "#"
        } else if (j == 5) {
            str += "#"
        } else {
            str += "."
        }  
    }
    str += "\n"
}
console.log(str)

