// Сделайте задание Comparison: sizes из предыдущего ДЗ используя switch
//------------------

let size = +prompt('Введите размер брюк в нашей системе размеров (от 40 до 54)');
switch (size){
    case 40: alert('Размер в американской системе: 6')
        break
    case 42: alert('Размер в американской системе: 8')
        break
    case 44: alert('Размер в американской системе: 10')
        break
    case 46: alert('Размер в американской системе: 12')
        break
    case 48: alert('Размер в американской системе: 14')
        break
    case 50: alert('Размер в американской системе: 16')
        break
    case 52: alert('Размер в американской системе: 18')
        break
    case 54: alert('Размер в американской системе: 20')
        break
    default: alert('У Вас нестандартный размер')
}





